Show / Hide Table of Contents
Class MatSteelRUS
Material steel RUS
Inheritance
System.Object
OpenObject
OpenElementId
Material
MatSteel
MatSteelRUS
Inherited Members
 Material.Name
 Material.LoadFromLibrary
 Material.E
 Material.G
 Material.Poisson
 Material.UnitMass
 Material.SpecificHeat
 Material.ThermalExpansion
 Material.ThermalConductivity
 Material.IsDefaultMaterial
 Material.OrderInCode
 Material.StateOfThermalExpansion
 Material.StateOfThermalConductivity
 Material.StateOfThermalSpecificHeat
 Material.StateOfThermalStressStrain
 Material.StateOfThermalStrain
 Material.UserThermalSpecificHeatCurvature
 Material.UserThermalConductivityCurvature
 Material.UserThermalExpansionCurvature
 Material.UserThermalStrainCurvature
 Material.UserThermalStressStrainCurvature
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Material
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Libraries.Material.RUS.MatSteelRUS,CI.Material", "CI.StructModel.Libraries.Material.IMaterial,CI.BasicTypes", typeof(MatSteel))]
public class MatSteelRUS : MatSteel
Properties
Improve this Doc   View Source
fu
Ultimate strength
Declaration
public double fu { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
fy
Yield strength
Declaration
public double fy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GammaM
Safety coefficient
Declaration
public double GammaM { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source